Autodesk.Revit.DB.SpatialElementGeometryCalculator.CanCalculateGeometry(Autodesk.Revit.DB.SpatialElement)
This indicates whether the input spatial element is a valid one.
spatialElement:
The spatial element to be checked if its geometry can be calculated.
Returns:
It will return false if the room/space is not enclosed in 2d or has no location, or the height is too small.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2012

Autodesk.Revit.DB.SpatialElementGeometryCalculator.IsRoomOrSpace(Autodesk.Revit.DB.SpatialElement)
This indicates whether the input spatial element is a room or a space.
spatialElement:
The spatial element to be checked if it is a room or a space or not.
Returns:
True if the input spatial element is a room or a space, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2012

Autodesk.Revit.DB.SpatialElementGeometryCalculator.CalculateSpatialElementGeometry(Autodesk.Revit.DB.SpatialElement)
Compute the spatial element geometry and returns the boundary face information.
spatialElement:
Specifies the spatial element needs to be computed, should be Room or Space.
Returns:
Requested boundary face information.
Throws Autodesk.Revit.Exceptions.ArgumentException:
spatialElement is not a room or a space, and thus has no 3D geometry to calculate.
-or-
spatialElement is not enclosed in 2d or has no location, or the height is too small, and thus has no 3D geometry to calculate.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Failed to compute the given spatial element's geometry.
Since:
2012

Autodesk.Revit.DB.SpatialElementGeometryCalculator.#ctor(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.SpatialElementBoundaryOptions)
Constructs a new calculator for the geometry of spatial elements.
aDoc:
The document that contains the spatial elements.
options:
The options to control the calculation rules.
Throws Autodesk.Revit.Exceptions.ArgumentException:
options is not valid.  Only Finish and Center of SpatialElementBoundaryLocation are allowed.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2012

Autodesk.Revit.DB.SpatialElementGeometryCalculator.#ctor(Autodesk.Revit.DB.Document)
Constructs a new calculator with default options for the geometry of spatial elements.
aDoc:
The document that contains the spatial elements.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2012